Show / Hide Table of Contents
Class TendonBar
Tendon bar
Inheritance
System.Object
OpenObject
TendonBar
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Services.Concrete.ReinforcedSection.TendonBar,CI.ReinforcedSection")]
public class TendonBar : OpenObject
Properties
Improve this Doc   View Source
Id
Tendon Id
Declaration
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Material
Material
Declaration
public ReferenceElement Material { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
NumStrandsInTendon
number of ropes in tendon
Declaration
public int NumStrandsInTendon { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Phase
Phase
Declaration
public int Phase { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Point
Position of bar
Declaration
[OpenModelProperty("CentrePoint")]
public Point2D Point { get; set; }
Property Value
 Type |  Description
 Point2D
Improve this Doc   View Source
PrestressingOrder
order of tendon prestessing
Declaration
public int PrestressingOrder { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
PrestressReinforcementType
set of prestress reinforcement type
Declaration
public FatigueTypeOfPrestressingSteel PrestressReinforcementType { get; set; }
Property Value
 Type |  Description
 FatigueTypeOfPrestressingSteel
Improve this Doc   View Source
TendonDuct
Tendon duct
Declaration
public TendonDuct TendonDuct { get; set; }
Property Value
 Type |  Description
 TendonDuct
Improve this Doc   View Source
TendonType
Tendon type
Declaration
public TendonBarType TendonType { get; set; }
Property Value
 Type |  Description
 TendonBarType
 Improve this Doc
 View Source